Revit 2026 API

# ElementTransformUtilsMoveElements Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void MoveElements(
	Document document,
	ICollection<ElementId> elementsToMove,
	XYZ translation
)
```
```vb
Public Shared Sub MoveElements (
	document As Document,
	elementsToMove As ICollection(Of ElementId),
	translation As XYZ
)
```
```cpp
public:
static void MoveElements(
	Document^ document,
	ICollection<ElementId^>^ elementsToMove,
	XYZ^ translation
)
```
```fsharp
static member MoveElements :
        document : Document *
        elementsToMove : ICollection<ElementId> *
        translation : XYZ -> unit
```

#### Parameters

document Document

elementsToMove ICollectionElementId

translation XYZ

#### Reference

ElementTransformUtils Class

Autodesk.Revit.DB Namespace